using System;

namespace Example_2561
{
    class Program
    {
        static void Main(string[] args)
        {
            // Создать пустой ASP.NET Core проект
            // Продумать структуру внешнего вида Web-представлений разделов сайта
            // Сверстать представления используя базовые элементы
            // Добавить представления в проект
            // Создать несколько контроллеров и реализовать переход между ними

            // Использовать полученные знания для улучшения структуры, 
            // внешнего вида и архитектуры проекта.
            // 
        }
    }
}
